import { ScrollView, Text } from 'react-native'
import { Container } from '@/components/ui/Container'
import { fontFamily } from '@/constants/Fonts'
import HeaderBack from '@/components/ui/HeaderBack'
import { Page } from '@/components/ui/Page'

export const MockText = () => {
	return (
		<Text className="text-base text-gray-ab leading-[30px]" style={{ fontFamily: fontFamily.medium }}>
			Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей
			деятельности позволяет выполнять важные задания по разработке направлений прогрессивного развития. Равным
			образом постоянный количественный рост и сфера нашей активности способствует подготовки и реализации новых
			предложений. Равным образом дальнейшее развитие различных форм деятельности позволяет оценить значение
			позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же
			укрепление и развитие структуры требуют определения и уточнения форм развития. С другой стороны реализация
			намеченных плановых заданий в значительной степени обуславливает создание модели развития. Идейные
			соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей
			деятельности способствует подготовки и реализации систем массового участия. Идейные соображения высшего
			порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности способствует
			подготовки и реализации систем массового участия. Идейные соображения высшего порядка, а также постоянное
			информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации систем
			массового участия. Задача организации, в особенности же постоянное информационно-пропагандистское
			обеспечение нашей деятельности позволяет выполнять важные задания по разработке направлений прогрессивного
			развития. Равным образом постоянный количественный рост и сфера нашей активности способствует подготовки и
			реализации новых предложений. Равным образом дальнейшее развитие различных форм деятельности позволяет
			оценить значение позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в
			особенности же укрепление и развитие структуры требуют определения и уточнения форм развития. С другой
			стороны реализация намеченных плановых заданий в значительной степени обуславливает создание модели
			развития. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение
			нашей деятельности способствует подготовки и реализации систем массового участия. Идейные соображения
			высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности
			способствует подготовки и реализации систем массового участия. Идейные соображения высшего порядка, а также
			постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и
			реализации систем массового участия. Задача организации, в особенности же постоянное
			информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять важные задания по
			разработке направлений прогрессивного развития. Равным образом постоянный количественный рост и сфера нашей
			активности способствует подготовки и реализации новых предложений. Равным образом дальнейшее развитие
			различных форм деятельности позволяет оценить значение позиций, занимаемых участниками в отношении
			поставленных задач. Задача организации, в особенности же укрепление и развитие структуры требуют определения
			и уточнения форм развития. С другой стороны реализация намеченных плановых заданий в значительной степени
			обуславливает создание модели развития. Идейные соображения высшего порядка, а также постоянное
			информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации систем
			массового участия. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское
			обеспечение нашей деятельности способствует подготовки и реализации систем массового участия. Идейные
			соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей
			деятельности способствует подготовки и реализации систем массового участия. Задача организации, в
			особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять
			важные задания по разработке направлений прогрессивного развития. Равным образом постоянный количественный
			рост и сфера нашей активности способствует подготовки и реализации новых предложений. Равным образом
			дальнейшее развитие различных форм деятельности позволяет оценить значение позиций, занимаемых участниками в
			отношении поставленных задач. Задача организации, в особенности же укрепление и развитие структуры требуют
			определения и уточнения форм развития. С другой стороны реализация намеченных плановых заданий в
			значительной степени обуславливает создание модели развития. Идейные соображения высшего порядка, а также
			постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и
			реализации систем массового участия. Идейные соображения высшего порядка, а также постоянное
			информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации систем
			массового участия. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское
			обеспечение нашей деятельности способствует подготовки и реализации систем массового участия. Задача
			организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности
			позволяет выполнять важные задания по разработке направлений прогрессивного развития. Равным образом
			постоянный количественный рост и сфера нашей активности способствует подготовки и реализации новых
			предложений. Равным образом дальнейшее развитие различных форм деятельности позволяет оценить значение
			позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же
			укрепление и развитие структуры требуют определения и уточнения форм развития. С другой стороны реализация
			намеченных плановых заданий в значительной степени обуславливает создание модели развития. Идейные
			соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей
			деятельности способствует подготовки и реализации систем массового участия. Идейные соображения высшего
			порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности способствует
			подготовки и реализации систем массового участия. Идейные соображения высшего порядка, а также постоянное
			информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации систем
			массового участия. КОНЕЦ
		</Text>
	)
}

const DocumentPage = () => {
	return (
		<Page>
			<Container className="gap-[20px]">
				<HeaderBack>Просмотр документа</HeaderBack>
				<ScrollView contentContainerStyle={{ paddingBottom: 100 }}>
					<MockText />
				</ScrollView>
			</Container>
		</Page>
	)
}

export default DocumentPage
